# pandas：数据分析处理库

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/titanic.csv')

In [5]:
#读取前几条数据,指定前几条
df.head(3)

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male

In [6]:
#返回当前的信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
row.names    1313 non-null int64
pclass       1313 non-null object
survived     1313 non-null int64
name         1313 non-null object
age          633 non-null float64
embarked     821 non-null object
home.dest    754 non-null object
room         77 non-null object
ticket       69 non-null object
boat         347 non-null object
sex          1313 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 112.9+ KB

In [8]:
#查看索引
df.index

RangeIndex(start=0, stop=1313, step=1)

In [10]:
df.columns

Index(['row.names', 'pclass', 'survived', 'name', 'age', 'embarked',
       'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [12]:
df.dtypes

row.names      int64
pclass        object
survived       int64
name          object
age          float64
embarked      object
home.dest     object
room          object
ticket        object
boat          object
sex           object
dtype: object

In [13]:
df.values

array([[1, '1st', 1, ..., '24160 L221', '2', 'female'],
       [2, '1st', 0, ..., nan, nan, 'female'],
       [3, '1st', 0, ..., nan, '(135)', 'male'],
       ...,
       [1311, '3rd', 0, ..., nan, nan, 'male'],
       [1312, '3rd', 0, ..., nan, nan, 'female'],
       [1313, '3rd', 0, ..., nan, nan, 'male']], dtype=object)

In [14]:
#自己创建一个DataFrame结构
data = {
    'country': ['aaa', 'bbb', 'ccc'],
    'population':[10, 12, 14]
}
df_data = pd.DataFrame(data)
df_data

  country  population
0     aaa          10
1     bbb          12
2     ccc          14

In [15]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
country       3 non-null object
population    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

##### 取指定的数据

In [18]:
age = df['age']
age[:5]

0    29.0000
1     2.0000
2    30.0000
3    25.0000
4     0.9167
Name: age, dtype: float64

series:dataframe中的一行、列

In [19]:
age.index

RangeIndex(start=0, stop=1313, step=1)

In [20]:
age.values[:5]

array([29.    ,  2.    , 30.    , 25.    ,  0.9167])

In [21]:
df.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

##### 指定索引

In [22]:
df = df.set_index('name')
df.head()

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allen, Miss Elisabeth Walton",1,1st,1,29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
"Allison, Miss Helen Loraine",2,1st,0,2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Mr Hudson Joshua Creighton",3,1st,0,30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Master Hudson Trevor",5,1st,1,0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [23]:
df['age'][:5]

name
Allen, Miss Elisabeth Walton                       29.0000
Allison, Miss Helen Loraine                         2.0000
Allison, Mr Hudson Joshua Creighton                30.0000
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)    25.0000
Allison, Master Hudson Trevor                       0.9167
Name: age, dtype: float64

In [24]:
age = df['age']
age['Allen, Miss Elisabeth Walton']

29.0

In [26]:
age = age + 10
age[:5]

name
Allen, Miss Elisabeth Walton                       49.0000
Allison, Miss Helen Loraine                        22.0000
Allison, Mr Hudson Joshua Creighton                50.0000
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)    45.0000
Allison, Master Hudson Trevor                      20.9167
Name: age, dtype: float64

In [27]:
age.mean() #均值

51.19418104265402

In [28]:
age.max()

91.0

In [29]:
age.min()

20.1667

In [30]:
#统计
df.describe()

         row.names     survived         age
count  1313.000000  1313.000000  633.000000
mean    657.000000     0.341965   31.194181
std     379.174762     0.474549   14.747525
min       1.000000     0.000000    0.166700
25%     329.000000     0.000000   21.000000
50%     657.000000     0.000000   30.000000
75%     985.000000     1.000000   41.000000
max    1313.000000     1.000000   71.000000

## pandas索引

In [34]:
df = pd.read_csv('./data/titanic.csv')
df['age'][:5]

0    29.0000
1     2.0000
2    30.0000
3    25.0000
4     0.9167
Name: age, dtype: float64

In [36]:
df[['age', 'pclass']][:5]

       age pclass
0  29.0000    1st
1   2.0000    1st
2  30.0000    1st
3  25.0000    1st
4   0.9167    1st

loc 用label定位<br/>
iloc 用position定位

In [37]:
#拿到其中一个数据
df.iloc[0]

row.names                               1
pclass                                1st
survived                                1
name         Allen, Miss Elisabeth Walton
age                                    29
embarked                      Southampton
home.dest                    St Louis, MO
room                                  B-5
ticket                         24160 L221
boat                                    2
sex                                female
Name: 0, dtype: object

In [38]:
df.iloc[0:5]

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [39]:
#要其中部分列
df.iloc[0:5, 1:3]

  pclass  survived
0    1st         1
1    1st         0
2    1st         0
3    1st         0
4    1st         1

In [40]:
df = df.set_index('name')

In [41]:
df.loc['Allison, Mr Hudson Joshua Creighton']

row.names                                  3
pclass                                   1st
survived                                   0
age                                       30
embarked                         Southampton
home.dest    Montreal, PQ / Chesterville, ON
room                                     C26
ticket                                   NaN
boat                                   (135)
sex                                     male
Name: Allison, Mr Hudson Joshua Creighton, dtype: object

In [42]:
#qu'chu
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass']

'1st'

In [44]:
#这样切片也可以
df.loc['Allison, Mr Hudson Joshua Creighton':'Allison, Master Hudson Trevor']

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allison, Mr Hudson Joshua Creighton",3,1st,0,30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Master Hudson Trevor",5,1st,1,0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [45]:
#赋值操作
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass'] = '2nd'

In [46]:
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass']

'2nd'

### bool类型索引

In [47]:
df['age'] > 20

name
Allen, Miss Elisabeth Walton                         True
Allison, Miss Helen Loraine                         False
Allison, Mr Hudson Joshua Creighton                  True
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)      True
Allison, Master Hudson Trevor                       False
Anderson, Mr Harry                                   True
Andrews, Miss Kornelia Theodosia                     True
Andrews, Mr Thomas, jr                               True
Appleton, Mrs Edward Dale (Charlotte Lamson)         True
Artagaveytia, Mr Ramon                               True
Astor, Colonel John Jacob                            True
Astor, Mrs John Jacob (Madeleine Talmadge Force)    False
Aubert, Mrs Leontine Pauline                        False
Barkworth, Mr Algernon H.                           False
Baumann, Mr John D.                                 False
Baxter, Mrs James (Helene DeLaudeniere Chaput)       True
Baxter, Mr Quigg Edmond                              True
Beattie, Mr Thomson                                  True
Beckwith, Mr Richard Leonard                         True
Beckwith, Mrs Richard Leonard (Sallie Monypeny)      True
Behr, Mr Karl Howell                                 True
Birnbaum, Mr Jakob                                   True
Bishop, Mr Dickinson H.                              True
Bishop, Mrs Dickinson H. (Helen Walton)             False
Bjornstrm-Steffansson, Mr Mauritz Hakan              True
Blackwell, Mr Stephen Weart                          True
Blank, Mr Henry                                      True
Bonnell, Miss Caroline                               True
Bonnell, Miss Elizabeth                              True
Borebank, Mr John James                             False
                                                    ...
Vestrom, Miss Hulda Amanda Adolfina                 False
Vonk, Mr Jenko                                      False
Ware, Mr Frederick                                  False
Warren, Mr Charles William                          False
Wazli, Mr Yousif                                    False
Webber, Mr James                                    False
Wennerstrom, Mr August Edvard                       False
Wenzel, Mr Linhart                                  False
Widegren, Mr Charles Peter                          False
Wiklund, Mr Jacob Alfred                            False
Wilkes, Mrs Ellen                                   False
Willer, Mr Aaron                                    False
Willey, Mr Edward                                   False
Williams, Mr Howard Hugh                            False
Williams, Mr Leslie                                 False
Windelov, Mr Einar                                  False
Wirz, Mr Albert                                     False
Wiseman, Mr Phillippe                               False
Wittevrongel, Mr Camiel                             False
Yalsevac, Mr Ivan                                   False
Yasbeck, Mr Antoni                                  False
Yasbeck, Mrs Antoni                                 False
Youssef, Mr Gerios                                  False
Zabour, Miss Hileni                                 False
Zabour, Miss Tamini                                 False
Zakarian, Mr Artun                                  False
Zakarian, Mr Maprieder                              False
Zenn, Mr Philip                                     False
Zievens, Rene                                       False
Zimmerman, Leo                                      False
Name: age, Length: 1313, dtype: bool

In [49]:
df[df['age'] > 20][:5]

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allen, Miss Elisabeth Walton",1,1st,1,29.0,Southampton,"St Louis, MO",B-5,24160 L221,2,female
"Allison, Mr Hudson Joshua Creighton",3,2nd,0,30.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Anderson, Mr Harry",6,1st,1,47.0,Southampton,"New York, NY",E-12,NaN,3,male
"Andrews, Miss Kornelia Theodosia",7,1st,1,63.0,Southampton,"Hudson, NY",D-7,13502 L77,10,female

In [51]:
#对所有男性的年龄求平均值
df.loc[df['sex'] == 'male', 'age'].mean()

31.58141

In [52]:
#统计年龄大于70的人数
(df['age'] > 70).sum()

3

### groupby

In [53]:
df = pd.DataFrame({
    'key':['A','B','C','A','B','C','A','B','C'],
    'data':[0,5,10,5,10,15,10,15,20]
})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [54]:
for key in ['A', 'B', 'C']:
    print(key, ":")
    print(df[df['key'] == key].sum())

A :
key     AAA
data     15
dtype: object
B :
key     BBB
data     30
dtype: object
C :
key     CCC
data     45
dtype: object

In [58]:
df.groupby('key').mean()

     data
key
A       5
B      10
C      15

In [59]:
#groupby可以结合numpy来使用
import numpy as np
df.groupby('key').aggregate(np.mean)

     data
key
A       5
B      10
C      15

In [61]:
df = pd.read_csv('./data/titanic.csv')

In [62]:
df.groupby('sex')['age'].mean()

sex
female    30.572702
male      31.581410
Name: age, dtype: float64

In [63]:
df.groupby('sex')['survived'].mean()

sex
female    0.663067
male      0.167059
Name: survived, dtype: float64

## 数值计算

In [64]:
df = pd.DataFrame(
    [
    [1,2,3],
    [4,5,6]
    ], 
    index = ['a','b'], columns=['A','B','C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [66]:
#默认按列求和
df.sum()

A    5
B    7
C    9
dtype: int64

In [67]:
df.sum(axis=1)

a     6
b    15
dtype: int64

In [68]:
df.sum(axis='columns')

a     6
b    15
dtype: int64

In [69]:
df.mean()

A    2.5
B    3.5
C    4.5
dtype: float64

In [70]:
df.min()
df.max()
df.median()

A    2.5
B    3.5
C    4.5
dtype: float64

### 二元统计

In [71]:
df = pd.read_csv('./data/titanic.csv')
df.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [72]:
#特征之间的协方差
df.cov()

               row.names   survived          age
row.names  143773.500000 -64.001524 -1404.024271
survived      -64.001524   0.225196    -0.586996
age         -1404.024271  -0.586996   217.489502

In [73]:
#相关系数
df.corr()

           row.names  survived       age
row.names   1.000000 -0.355689 -0.389162
survived   -0.355689  1.000000 -0.080048
age        -0.389162 -0.080048  1.000000

In [76]:
#不同年龄的人的个数
df['age'].value_counts()

30.0000    28
18.0000    25
36.0000    23
22.0000    23
24.0000    22
21.0000    21
19.0000    21
23.0000    20
26.0000    20
28.0000    19
25.0000    18
32.0000    18
20.0000    17
45.0000    17
27.0000    16
35.0000    14
40.0000    13
31.0000    12
33.0000    12
34.0000    11
50.0000    11
39.0000    11
48.0000    11
38.0000    10
17.0000    10
16.0000    10
29.0000    10
42.0000     9
49.0000     9
46.0000     8
           ..
6.0000      5
60.0000     5
56.0000     4
8.0000      4
1.0000      4
57.0000     4
4.0000      4
13.0000     4
5.0000      3
0.8333      3
71.0000     3
15.0000     3
53.0000     3
14.0000     3
11.0000     3
51.0000     3
59.0000     3
61.0000     3
62.0000     2
63.0000     2
12.0000     2
65.0000     2
69.0000     1
7.0000      1
67.0000     1
70.0000     1
0.9167      1
0.1667      1
10.0000     1
0.3333      1
Name: age, Length: 73, dtype: int64

In [77]:
#按照升序排列
df['age'].value_counts(ascending = True)

0.3333      1
10.0000     1
0.1667      1
0.9167      1
70.0000     1
67.0000     1
7.0000      1
69.0000     1
65.0000     2
12.0000     2
63.0000     2
62.0000     2
61.0000     3
59.0000     3
51.0000     3
11.0000     3
14.0000     3
53.0000     3
15.0000     3
71.0000     3
0.8333      3
5.0000      3
13.0000     4
4.0000      4
57.0000     4
1.0000      4
8.0000      4
56.0000     4
60.0000     5
6.0000      5
           ..
46.0000     8
49.0000     9
42.0000     9
29.0000    10
16.0000    10
17.0000    10
38.0000    10
48.0000    11
39.0000    11
50.0000    11
34.0000    11
33.0000    12
31.0000    12
40.0000    13
35.0000    14
27.0000    16
45.0000    17
20.0000    17
32.0000    18
25.0000    18
28.0000    19
26.0000    20
23.0000    20
19.0000    21
21.0000    21
24.0000    22
22.0000    23
36.0000    23
18.0000    25
30.0000    28
Name: age, Length: 73, dtype: int64

In [78]:
#平均分成n组
df['age'].value_counts(ascending = True, bins = 5)

(56.833, 71.0]       39
(0.0949, 14.333]     59
(42.667, 56.833]    106
(28.5, 42.667]      184
(14.333, 28.5]      245
Name: age, dtype: int64

In [79]:
#统计不为0的样本的个数
print(df['age'].count())
print(df['pclass'].count())

633
1313

## 对象操作 Series增删改查

In [80]:
data = [10,11,12]
index = ['a','b','c']
s = pd.Series(data = data, index = index)
s

a    10
b    11
c    12
dtype: int64

In [81]:
print(s[0])
print(s[0:2])

10
a    10
b    11
dtype: int64

In [82]:
mask = [True, False, True]
s[mask]

a    10
c    12
dtype: int64

In [83]:
s.loc['b']

11

In [84]:
s.iloc[1]

11

In [85]:
s[1]

11

In [88]:
s1 = s.copy()
s1['a'] = 100
s1

a    100
b     11
c     12
dtype: int64

In [91]:
#三个参数：要修改的值、改成什么、是否覆盖原来的内容
s1.replace(to_replace=100, value=101, inplace=True)
s1

a    101
b     11
c     12
dtype: int64

In [92]:
#改变索引
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [93]:
s1.index=['a','b','d']
s1

a    101
b     11
d     12
dtype: int64

In [94]:
s1.rename(index={'a':'A'}, inplace=True)

In [95]:
s1

A    101
b     11
d     12
dtype: int64

In [96]:
s2 = pd.Series([100,500], ['g','h'])

In [97]:
s2

g    100
h    500
dtype: int64

### 增操作

In [100]:
#s1不改变，在s1的基础上增加s2
s1.append(s2)

A    101
b     11
d     12
g    100
h    500
dtype: int64

In [101]:
#直接增加结果
s1['j']=500
s1

A    101
b     11
d     12
j    500
dtype: int64

In [102]:
#是否生成新的索引
s1.append(s2, ignore_index=False)

A    101
b     11
d     12
j    500
g    100
h    500
dtype: int64

In [103]:
s1.append(s2, ignore_index=True)

0    101
1     11
2     12
3    500
4    100
5    500
dtype: int64

### 删操作

In [104]:
s1

A    101
b     11
d     12
j    500
dtype: int64

In [105]:
#删除单行
del s1['A']
s1

b     11
d     12
j    500
dtype: int64

In [106]:
#删除多行
s1.drop(['b','d'], inplace=True)
s1

j    500
dtype: int64

## DataFrame结构的增删改查

In [107]:
data = [[1,2,3],[4,5,6]]
index=['a','b']
columns = ['A', 'B', 'C']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

   A  B  C
a  1  2  3
b  4  5  6

In [108]:
#取列
df["A"]

a    1
b    4
Name: A, dtype: int64

In [111]:
#取一行
#这样子会报错
#df[0]
print(df.iloc[0])
print(df.loc['a'])

A    1
B    2
C    3
Name: a, dtype: int64
A    1
B    2
C    3
Name: a, dtype: int64

### 改操作

In [112]:
df.loc['a']['A']

1

In [113]:
#直接改一个值
df.loc['a']['A'] = 150
df

     A  B  C
a  150  2  3
b    4  5  6

In [114]:
#修改索引
df.index = ['f','g']
df

     A  B  C
f  150  2  3
g    4  5  6

### 增操作

In [115]:
#增加行，注意与增加列区别
df.loc['c'] = [1,2,3]

In [116]:
df

     A  B  C
f  150  2  3
g    4  5  6
c    1  2  3

In [117]:
data = [[1,2,3],[4,5,6]]
index=['j','k']
columns = ['A', 'B', 'C']

df2 = pd.DataFrame(data=data, index=index, columns=columns)
df2

   A  B  C
j  1  2  3
k  4  5  6

In [118]:
df3 = pd.concat([df,df2])
df3

     A  B  C
f  150  2  3
g    4  5  6
c    1  2  3
j    1  2  3
k    4  5  6

In [121]:
df3 = pd.concat([df,df2], axis=0)#默认轴是0
df3

     A  B  C
f  150  2  3
g    4  5  6
c    1  2  3
j    1  2  3
k    4  5  6

In [122]:
#增加列，注意与增加行区别
df2['D']=[10,11]
df2

   A  B  C   D
j  1  2  3  10
k  4  5  6  11

In [123]:
#增加多列
df4=pd.DataFrame([[10,11], [12,13]], index=['j','k'], columns=['E','F'])
df4

    E   F
j  10  11
k  12  13

In [124]:
df5=pd.concat([df2,df4], axis=1)
df5

   A  B  C   D   E   F
j  1  2  3  10  10  11
k  4  5  6  11  12  13

### 删操作

In [125]:
#按行删
df5.drop(['j'], axis=0,inplace=False)

   A  B  C   D   E   F
k  4  5  6  11  12  13

In [126]:
#删除一列
del df5['A']

In [127]:
df5

   B  C   D   E   F
j  2  3  10  10  11
k  5  6  11  12  13

In [128]:
#删除多列
df5.drop(['B', 'C'], axis=1)

    D   E   F
j  10  10  11
k  11  12  13

### merge操作

In [134]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],})
print(left)
print("--------------------")
print(right)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
--------------------
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [136]:
#on的参数是以什么指标合并，例子中为key
pd.merge(left,right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [139]:
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],})
right = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],})

In [140]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K2  A2  B2
3   K3   K3  A3  B3

In [141]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K2  C2  D2
3   K3   K3  C3  D3

In [142]:
pd.merge(left, right, on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K1     K1  A1  B1     K1  C1  D1
2   K2     K2  A2  B2     K2  C2  D2
3   K3     K3  A3  B3     K3  C3  D3

In [143]:
#key2上有一个值不同
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],})
right = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K2','K4'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],})

In [144]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K2  A2  B2
3   K3   K3  A3  B3

In [145]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K2  C2  D2
3   K3   K4  C3  D3

In [146]:
#只合并关键字完全相同的
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2

In [149]:
#外连接
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1   C1   D1
2   K2   K2   A2   B2   C2   D2
3   K3   K3   A3   B3  NaN  NaN
4   K3   K4  NaN  NaN   C3   D3

In [148]:
pd.merge(left, right, on=['key1', 'key2'], how='outer', indicator=True)

  key1 key2    A    B    C    D      _merge
0   K0   K0   A0   B0   C0   D0        both
1   K1   K1   A1   B1   C1   D1        both
2   K2   K2   A2   B2   C2   D2        both
3   K3   K3   A3   B3  NaN  NaN   left_only
4   K3   K4  NaN  NaN   C3   D3  right_only

In [150]:
#左外连接
pd.merge(left, right, on=['key1', 'key2'], how='left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K1  A1  B1   C1   D1
2   K2   K2  A2  B2   C2   D2
3   K3   K3  A3  B3  NaN  NaN

In [153]:
#右外连接
pd.merge(left, right, on=['key1', 'key2'], how='right', indicator=True)

  key1 key2    A    B   C   D      _merge
0   K0   K0   A0   B0  C0  D0        both
1   K1   K1   A1   B1  C1  D1        both
2   K2   K2   A2   B2  C2  D2        both
3   K3   K4  NaN  NaN  C3  D3  right_only

## 显示设置

更多内容查阅官方文档

In [154]:
#打印显示最大行数
pd.get_option('display.max_rows')

60

In [156]:
#设置最大打印行数
pd.set_option('display.max_rows', 10)

In [157]:
pd.Series(index=range(0,100))

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [158]:
pd.set_option('display.max_rows', 60)

In [159]:
#最大打印列数
pd.get_option('display.max_columns')

20

In [160]:
pd.DataFrame(columns=range(0,30))

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
Index: []

[0 rows x 30 columns]

In [161]:
#字符串长度
pd.get_option('display.max_colwidth')

50

In [163]:
pd.Series(index=['A'], data=['t'*70])

A    tttttttttttttttttttttttttttttttttttttttttttttt...
dtype: object

In [164]:
#打印精度
pd.get_option('display.precision')

6

In [165]:
pd.Series(data=[1.23456789])

0    1.234568
dtype: float64

## 数据透视表 pivot操作

In [185]:
example = pd.DataFrame({'Month': ["January","January","January","January",
                                    "February","February","February", "February",
                                    "March","March", "March", "March"],
            'Category':["Transportation","Grocery","Household","Entertainment",
                        "Transportation","Grocery","Household","Entertainment",
                        "Transportation","Grocery","Household","Entertainment"],
            'Amount': [74.,235.,175.,100.,115.,240.,225., 125.,90.,260., 200.,120.]})
example

       Month        Category  Amount
0    January  Transportation    74.0
1    January         Grocery   235.0
2    January       Household   175.0
3    January   Entertainment   100.0
4   February  Transportation   115.0
5   February         Grocery   240.0
6   February       Household   225.0
7   February   Entertainment   125.0
8      March  Transportation    90.0
9      March         Grocery   260.0
10     March       Household   200.0
11     March   Entertainment   120.0

In [186]:
example_pivot = example.pivot(index='Category', columns='Month', values='Amount')

In [187]:
example_pivot

Month           February  January  March
Category
Entertainment      125.0    100.0  120.0
Grocery            240.0    235.0  260.0
Household          225.0    175.0  200.0
Transportation     115.0     74.0   90.0

In [188]:
example_pivot.sum(axis=1)

Category
Entertainment     345.0
Grocery           735.0
Household         600.0
Transportation    279.0
dtype: float64

In [189]:
example_pivot.sum(axis=0)

Month
February    705.0
January     584.0
March       670.0
dtype: float64

In [191]:
df = pd.read_csv('./data/titanic.csv')
df.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [193]:
#统计男性和女性在1-3等舱的年龄，默认求平均值
df.pivot_table(index='sex', columns='pclass', values='age')

pclass        1st        2nd        3rd
sex
female  37.772277  27.388235  22.564328
male    41.199334  28.910761  25.327294

In [195]:
df.pivot_table(index='sex', columns='pclass', values='age', aggfunc='max')

pclass   1st   2nd   3rd
sex
female  69.0  57.0  48.0
male    71.0  71.0  65.0

In [196]:
df.pivot_table(index='sex', columns='pclass', values='age', aggfunc='count')

pclass  1st  2nd  3rd
sex
female  101   85   57
male    125  127  138

In [198]:
#另一种计数方式
pd.crosstab(index=df['sex'], columns=df['pclass'])

pclass  1st  2nd  3rd
sex
female  143  107  213
male    179  173  498

In [199]:
#船舱的不同等级在不同的性别上获救的情况
df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc='mean')

sex       female      male
pclass
1st     0.937063  0.329609
2nd     0.878505  0.144509
3rd     0.370892  0.116466

In [200]:
#未成年人当中不同性别获救情况
df['underaged'] = df['age'] <= 18

In [201]:
df.pivot_table(index='underaged', columns='sex', values='survived', aggfunc='mean')

sex          female      male
underaged
False      0.652812  0.149310
True       0.740741  0.433962

## 时间操作

In [202]:
#python中的时间操作
import datetime
dt = datetime.datetime(year=2017, month=11, day=24, hour=10, minute=30)
dt

datetime.datetime(2017, 11, 24, 10, 30)

In [203]:
print(dt)

2017-11-24 10:30:00

In [204]:
#pandas时间操作
ts = pd.Timestamp('2017-11-24')

In [205]:
ts

Timestamp('2017-11-24 00:00:00')

In [206]:
ts.month

11

In [207]:
ts.day

24

In [208]:
ts + pd.Timedelta('5 days')

Timestamp('2017-11-29 00:00:00')

In [209]:
pd.to_datetime('2017-11-24')

Timestamp('2017-11-24 00:00:00')

In [210]:
pd.to_datetime('24/11/2017')

Timestamp('2017-11-24 00:00:00')

In [212]:
s = pd.Series(['2017-11-24 00:00:00','2017-11-25 00:00:00','2017-11-26 00:00:00'])
s

0    2017-11-24 00:00:00
1    2017-11-25 00:00:00
2    2017-11-26 00:00:00
dtype: object

In [213]:
#将Series转换为datetime类型
ts = pd.to_datetime(s)
ts

0   2017-11-24
1   2017-11-25
2   2017-11-26
dtype: datetime64[ns]

In [214]:
ts.dt.hour

0    0
1    0
2    0
dtype: int64

In [215]:
ts.dt.weekday

0    4
1    5
2    6
dtype: int64

In [217]:
#构造时间序列
pd.Series(pd.date_range(start='2017-11-24', periods=10, freq='12H'))

0   2017-11-24 00:00:00
1   2017-11-24 12:00:00
2   2017-11-25 00:00:00
3   2017-11-25 12:00:00
4   2017-11-26 00:00:00
5   2017-11-26 12:00:00
6   2017-11-27 00:00:00
7   2017-11-27 12:00:00
8   2017-11-28 00:00:00
9   2017-11-28 12:00:00
dtype: datetime64[ns]

In [218]:
#剩下的操作参考视频

## pandas的一些常用操作

In [219]:
data = pd.DataFrame({
    'group': ['a','a','a','b','b','b','c','c','c'],
    'data':[4,3,2,1,5,6,7,8,9]
})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b     5
5     b     6
6     c     7
7     c     8
8     c     9

In [223]:
#data从小到大，group从大到小排列, 降序false升序true
data.sort_values(by=['group', 'data'], ascending=[False, True], inplace=True)
data

  group  data
6     c     7
7     c     8
8     c     9
3     b     1
4     b     5
5     b     6
2     a     2
1     a     3
0     a     4

In [225]:
data = pd.DataFrame({
    'k1':['one']*3 + ['two'] * 4,
    'k2':[1,2,3,3,3,4,4]
})
data

    k1  k2
0  one   1
1  one   2
2  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [226]:
#去掉重复数据
data.drop_duplicates()

    k1  k2
0  one   1
1  one   2
2  one   3
3  two   3
5  two   4

In [229]:
#以k1为基准去重
data.drop_duplicates(subset='k1')

    k1  k2
0  one   1
3  two   3

In [237]:
data = pd.DataFrame({'food' :['A1','A2','B1','B2','B3','C1','C2'],
                     'data' :[1,2,3,4,5,6, 7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [238]:
#同类项合并
#方法一：需要自己指定一个函数
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'
    elif series['food'] == 'C3':
        return 'C'

#data.apply可以对数据的每一行或者每一列执行同样的操作
data['food_map'] = data.apply(food_map,axis='columns')
data

  food  data food_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [239]:
#另一种渐变的同类项合并（字典映射）
#需要自己指定一个字典
food2Upper={
    'A1': 'A',
    'A2': 'A',
    'B1': 'B',
    'B2': 'B',
    'B3': 'B',
    'C1': 'C',
    'C2': 'C'
}
data['upper'] = data['food'].map(food2Upper)
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [255]:
df = pd.DataFrame({
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)
})
df2 = df.assign(ration=df['data1']/df['data2'])
df2

      data1     data2    ration
0  0.700277  0.206727  3.387451
1  0.279555  0.652735  0.428283
2 -0.028376 -0.541903  0.052364
3 -0.278409 -0.741416  0.375510
4  1.394691 -0.215939 -6.458724

In [256]:
df2.drop('ration', axis='columns', inplace=True)
df2

      data1     data2
0  0.700277  0.206727
1  0.279555  0.652735
2 -0.028376 -0.541903
3 -0.278409 -0.741416
4  1.394691 -0.215939

In [257]:
#替换Series中的值
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [259]:
#替换多个值传入一个list即可
data.replace([8,9], np.nan,inplace=True)
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
8    NaN
dtype: float64

In [260]:
#对数据做切分
ages=[15,80,20,21,22,34,41,52,63,79]
bins=[10,40,80]
bins_res = pd.cut(ages,bins)

In [261]:
bins_res

[(10, 40], (40, 80], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64]): [(10, 40] < (40, 80]]

In [263]:
#显示数据属于哪个区间
bins_res.codes

array([0, 1, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int8)

In [264]:
#统计每个区间的元素数量
pd.value_counts(bins_res)

(40, 80]    5
(10, 40]    5
dtype: int64

In [265]:
#指定切分之后组的名字
group_names=['Youth', 'Middle', 'Old']
res = pd.cut(ages, [10, 20, 50, 80],labels=group_names)
pd.value_counts(res)

Old       4
Middle    4
Youth     2
dtype: int64

In [266]:
df = pd.DataFrame([range(3), [0,np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [267]:
#查找数据是否有缺省值
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [268]:
#默认按照列去看，前方给出的是列的索引
df.isnull().any()

0    False
1     True
2     True
dtype: bool

In [270]:
#前方给出的是行的索引
df.isnull().any(axis='columns')

0    False
1     True
2     True
3    False
dtype: bool

In [271]:
#把nan赋值为5
df.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [272]:
#对缺省值定位

#缺省值的索引
#df.isnull().any(axis='columns')

#找到带缺省值的行
df[df.isnull().any(axis='columns')]

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN

## groupby练习

In [274]:
df = pd.DataFrame ({
    'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
    'B': ['one', 'one','two', 'three', 'two', 'two', 'one', 'three'],
    'C': np.random.randn(8),
    'D': np.random.randn(8)
})
df

     A      B         C         D
0  foo    one  0.279521 -1.826119
1  bar    one  0.947128  2.181509
2  foo    two  0.672214  0.148014
3  bar  three -0.578778 -0.314715
4  foo    two  0.244183 -1.092969
5  bar    two  0.598227 -1.756114
6  foo    one -1.679312 -0.309461
7  foo  three  0.790311  0.922358

In [279]:
grouped = df.groupby('A')
print(grouped)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000002522DD4E668>

In [276]:
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [280]:
grouped = df.groupby(['A','B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [287]:
#自定义返回操作
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type, axis=1)
grouped.count()

   a  b
0  1  3
1  1  3
2  1  3
3  1  3
4  1  3
5  1  3
6  1  3
7  1  3

In [288]:
s = pd.Series([1,2,3,1,2,3],[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [291]:
grouped = s.groupby(level=0)
#索引中的第一部分
grouped.first()

5    3
7    2
8    1
dtype: int64

In [292]:
grouped.last()

5    3
7    2
8    1
dtype: int64